{
  "bio": "Gary Abbott began his career as a dancer in Atlanta, GA with Barbara Sullivan’s Atlanta Dance Theatre. There he developed his interest in choreography and created works for musicals presented by Jomandi Productions and The Clark College Players. Receiving a scholarship to attend California Institute of the Arts in 1979, Abbott studied with dance legends Crystine Lawson, Nicholas Gunn, and Mia Slavenska. Abbott later moved to Los Angeles where he danced with Lula Washington Dance Theatre and Los Angeles Contemporary Dance Theatre.In 1985, Abbott was invited to dance with the Cleo Parker Robinson Dance Ensemble of Denver, CO where he was nurtured by Ms. Parker-Robinson to create several dances that are still a part of the company’s repertoire. His career there allowed Abbott to study with many great luminaries of the dance world. Among them are Katherine Dunham, Donald McKayle, Eleo Pomare, Donald Byrd, and Kevin Iega Jeff.\n\nWhile residing in Denver, Abbott brought his choreographic talents to The Denver Center for the Performing Arts in the shows, Star Fever (based on The Bacchae by Euripides), and Don Quixote directed by Pavel Dobrusky. Abbott continued to work with Mr. Dobrusky at the Cleveland Playhouse, where he served as choreographer for the play Yerma by Federico Garcia Lorca. It was during his 10 years with the Cleo Parker Robinson Dance Ensemble that Abbott first visited Gillette, WY, and directed and choreographed a year-long project called Harambee. For more than 25 years, Abbott taught and directed artistic programming in the Gillette community. One of those programs is the “Performing Arts Workshop” (PAW) co-founded by Abbott, Jeff, and Suzanne Dowler and “Choose Dance” a program that brought dance to the community’s schools and at-risk youth organizations.\n\nAbbott and Jeff, along with Linda Spriggs, Diane Shober and LaVerne Alaphaire Jeff founded Deeply Rooted Dance Theater (DRDT) in 1995. The company’s mission is to re-imagine and diversify contemporary dance by bringing together modern, classical, and African-American traditions in dance enable Abbott to continue to serve and grow as an artist. Abbott and Jeff’s artistic goals extend beyond just the dance world and into the world of musical theatre as well. From 2001-2003, Abbott served as choreographer and Jeff as director for Black Nativity presented by the Penumbra Theatre. In 2008 Abbott choreographed “Ballad of Emmet Till” directed by Oz Scott for The Goodman Theater in Chicago and in 2010 Abbott shared choreographic duties with Mr. Jeff, for “Aida” for the Bailiwick Theater of Chicago. In Kansas City, he has choreographed for three shows for Kansas City Repertory Theater. “The Tallest Tree in the Forest”, directed by Moises Kaufman. ‘Fences’ directed by Ron OJ Parson and “Fear City” directed by Chip Miller.\n\nAbbott has had the privilege to teach and choreograph at many prestigious universities worldwide including special workshops in Vienna, Austria, and at Peridance Studios in New York City. He has taught and choreographed for Spelman College in Atlanta, Ga, Iliev Foundation in Bar, Montenegro, and Sofia, Bulgaria, Flatfoot Dance Theater at the University of KwaZulu Natal in Durban, South Africa, Tianjin Conservatory, Tianjin, China, and conducting workshops in Shenzhen, China.\n\nAbbott has been fortunate to choreograph works for Deeply Rooted Dance Theater, Wylliams/Henry Contemporary Dance Theater of Kansas City, MO., Dallas Black Dance Theater of Dallas, TX, Cleo Parker Robinson Dance of Denver, CO., David Taylor Dance Theater of Denver CO and others.\n\nAlong with his duties as Associate Artistic Director for DRDT, Gary Abbott also serves as Professor of Dance at the University of Missouri Kansas City Conservatory.",
  "artiststatement": "His work exists in and is inspired by the African American community. He’s a dance maker using curiosity and creativity to express, inspire, and rejuvenate all of those who are in search of uplift. Through choreography, he seeks to offer dance as a meeting place where ideas and fears can be examined and where each can fortify another’s spirit. He strives to celebrate humanity by using dance as a tool to explore the human condition."
}
